MostafaEdrees11/Mastering_Embedded_System_Online_Diploma/Unit8_MCU_Interfacing/Lesson7_I2C_Driver/I2C_Driver_STM32F103C6/STM32_F103C6_Drivers/I2C/STM32F103x8_I2C_Driver.c
/**
 ******************************************************************************
 * @file           : STM32F103x8_I2C_Driver.c
 * @author         : Mostafa Edrees
 * @brief          : I2C Driver
 * @date           : 29/11/2023
 * @board          : STM32F103C8T6
 * @processor      : ARM Cortex M3
 ******************************************************************************
 **/

#include "STM32F103x8_I2C_Driver.h"

/*
 * ======================================================================
 * 					Generic Variables
 * ======================================================================
 */
I2C_Configuration_t Gl_AI2C_CFG[2];


/*
 * ======================================================================
 * 					Generic Macros
 * ======================================================================
 */
#define I2C1_INDEX							0
#define I2C2_INDEX							1


/*
 * ======================================================================
 * 					Generic Functions
 * ======================================================================
 */
/**================================================================
 * @Fn			-I2C_Generate_Start_Condition
 * @brief 		-it is used to generate start condition
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-Functional_State: it is used to determine if we need to enable or disable this function
 * @param [in] 	-start: it is determine that we send start or repeated start
 * @retval 		-none
 * Note			-none
================================================================**/
void I2C_Generate_Start_Condition(I2C_TypeDef *I2Cx, Functional_State state, Start_State start)
{
	//check if we use start or repeated start because if we use normal start we should check that if the bus is bus
	//but when we use repeated start we don't check because the bus is busy because we use it.
	if(start != Repeated_Start)
	{
		//check if the bus is busy or not (Bus is idle)
		while(I2C_Get_Flag_Status(I2Cx, I2C_FlAG_BUS_BUSY));
	}

	//Bit 8 START: Start generation
	//This bit is set and cleared by software and cleared by hardware when start is sent or PE=0.
	//In Master Mode:
	//0: No Start generation
	//1: Repeated start generation
	//In Slave mode:
	//0: No Start generation
	//1: Start generation when the bus is free
	if(state == Fun_enable)
	{
		/* Generate the start condition */
		I2Cx->CR1 |= I2C_CR1_START;
	}
	else if(state == Fun_disable)
	{
		/* Don't Generate the start condition */
		I2Cx->CR1 &= ~(I2C_CR1_START);
	}
}

/**================================================================
 * @Fn			-I2C_Get_Flag_Status
 * @brief 		-it is used to see the status of the flag
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-flag: it is the flag that we need to check its status
 * @retval 		-we return the status of the flag --> set or reset
 * Note			-none
================================================================**/
Flag_Status I2C_Get_Flag_Status(I2C_TypeDef *I2Cx, Status flag)
{
	volatile uint32_t dummy_Read = 0;
	uint32_t flag1 = 0, flag2 = 0, Last_Event = 0;
	Flag_Status flag_state = reset;

	switch(flag)
	{
	//*******************************************************************************
	//Bit 1 BUSY: Bus busy
	//0: No communication on the bus
	//1: Communication ongoing on the bus
	//– Set by hardware on detection of SDA or SCL low
	//– cleared by hardware on detection of a Stop condition.
	//It indicates a communication in progress on the bus. This information is still updated when
	//the interface is disabled (PE=0).
	case I2C_FlAG_BUS_BUSY:
		if((I2Cx->SR2) & (I2C_SR2_BUSY))
			flag_state = set;
		else
			flag_state = reset;
		break;
	//*******************************************************************************

	//*******************************************************************************
		//EV5: SB=1, cleared by reading SR1 register followed by writing DR register with Address
		//Bit 0 SB: Start bit (Master mode)
		//0: No Start condition
		//1: Start condition generated.
		//– Set when a Start condition generated.
		//– Cleared by software by reading the SR1 register followed by writing the DR register, or by
		//hardware when PE=0
	case EV5:
		if((I2Cx->SR1) & (I2C_SR1_SB))
			flag_state = set;
		else
			flag_state = reset;
		break;
	//*******************************************************************************

	//*******************************************************************************
		//EV6: ADDR=1, cleared by reading SR1 register followed by reading SR2.
		//Bit 1 ADDR: Address sent (master mode)/matched (slave mode)
		//This bit is cleared by software reading SR1 register followed reading SR2, or by hardware
		//when PE=0.
		//Address matched (Slave)
		//0: Address mismatched or not received.
		//1: Received address matched.
		//– Set by hardware as soon as the received slave address matched with the OAR registers
		//content or a general call or a SMBus Device Default Address or SMBus Host or SMBus Alert
		//is recognized. (when enabled depending on configuration).
		//Note: In slave mode, it is recommended to perform the complete clearing sequence (READ
		//SR1 then READ SR2) after ADDR is set. Refer to Figure 272.
		//Address sent (Master)
		//0: No end of address transmission
		//1: End of address transmission
		//– For 10-bit addressing, the bit is set after the ACK of the 2nd byte.
		//– For 7-bit addressing, the bit is set after the ACK of the byte.
		//Note: ADDR is not set after a NACK reception
	case EV6:
		if((I2Cx->SR1) & (I2C_SR1_ADDR))
			flag_state = set;
		else
			flag_state = reset;
		break;
	//*******************************************************************************

	//*******************************************************************************
	case MASTER_BYTE_TRANSMITTING:
		/* Read I2Cx status registers */
		flag1 = I2Cx->SR1;
		flag2 = I2Cx->SR2;
		flag2 = flag2 << 16;

		/* Merge flag1 & flag2 in the same variable to get the last event */
		Last_Event = ((flag1 | flag2) & ((uint32_t)0x00FFFFFF));

		if((Last_Event & flag) == flag)
		{
			// last event is equal to I2C Event
			flag_state = set;
		}
		else
		{
			// last event is different from I2C Event
			flag_state = reset;
		}
		break;
	//*******************************************************************************

	//*******************************************************************************
		//EV8_1: TxE=1, shift register empty, data register empty, write Data1 in DR.
		//EV8: TxE=1, shift register not empty, d. ata register empty, cleared by writing DR register
		//Bit 7 TxE: Data register empty (transmitters)
		//0: Data register not empty
		//1: Data register empty
		//– Set when DR is empty in transmission. TxE is not set during address phase.
		//– Cleared by software writing to the DR register or by hardware after a start or a stop condition
		//or when PE=0.
		//TxE is not set if either a NACK is received, or if next byte to be transmitted is PEC (PEC=1)
		//Note: TxE is not cleared by writing the first data being transmitted, or by writing data when
		//BTF is set, as in both cases the data register is still empty.
	case EV8:
	case EV8_1:
		if((I2Cx->SR1) & (I2C_SR1_TXE))
			flag_state = set;
		else
			flag_state = reset;
		break;
	//*******************************************************************************

	//*******************************************************************************
		//EV7: RxNE = 1 cleared by reading DR register
		//Bit 6 RxNE: Data register not empty (receivers)
		//0: Data register empty
		//1: Data register not empty
		//– Set when data register is not empty in receiver mode. RxNE is not set during address phase.
		//– Cleared by software reading or writing the DR register or by hardware when PE=0.
		//RxNE is not set in case of ARLO event.
		//Note: RxNE is not cleared by reading data when BTF is set, as the data register is still full
	case EV7:
		if((I2Cx->SR1) & I2C_SR1_RXNE)
			flag_state = set;
		else
			flag_state = reset;
		break;
	//*******************************************************************************
	}


	return flag_state;
}

