MostafaEdrees11/Mastering_Embedded_System_Online_Diploma/Unit8_MCU_Interfacing/Lesson7_I2C_Driver/I2C_Driver_STM32F103C6/STM32_F103C6_Drivers/I2C/STM32F103x8_I2C_Driver.c
/**================================================================
 * @Fn			-I2C_Send_Address
 * @brief 		-it is used to send address with Read/Write bit
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-Address: it is the address that we need to send it
 * @param [in] 	-RW: it is determine that we need to write or read
 * @retval 		-none
 * Note			-none
================================================================**/
void I2C_Send_Address(I2C_TypeDef *I2Cx, uint16_t Address, I2C_Direction RW)
{
	uint8_t Index = (I2Cx == I2C1)? I2C1_INDEX : I2C2_INDEX;

	/* check if we are in 7-bit or 10-bit address mode */
	if(Gl_AI2C_CFG[Index].I2C_Slave_Device_Address.I2C_Slave_Address_Length == I2C_Slave_Address_Length_7Bit)
	{
		/* Send the Address */
		Address = (Address << 1);

		if(RW == I2C_Direction_Transimitter)
		{
			/* Clear RW bit when we write */
			Address &= ~(1 << 0);
		}
		else if(RW == I2C_Direction_Receiver)
		{
			/* Set RW bit when we read */
			Address |= (1 << 0);
		}

		I2Cx->DR = Address;
	}
	else if(Gl_AI2C_CFG[Index].I2C_Slave_Device_Address.I2C_Slave_Address_Length == I2C_Slave_Address_Length_10Bit)
	{
		//10-Bit slave address is not supported
	}
}

/**================================================================
 * @Fn			-I2C_Generate_Stop_Condition
 * @brief 		-it is used to generate stop condition
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-Functional_State: it is used to determine if we need to enable or disable this function
 * @retval 		-none
 * Note			-none
================================================================**/
void I2C_Generate_Stop_Condition(I2C_TypeDef *I2Cx, Functional_State state)
{
	//Bit 9 STOP: Stop generation
	//The bit is set and cleared by software, cleared by hardware when a Stop condition is
	//detected, set by hardware when a timeout error is detected.
	//In Master Mode:
	//0: No Stop generation.
	//1: Stop generation after the current byte transfer or after the current Start condition is sent.
	//In Slave mode:
	//0: No Stop generation.
	//1: Release the SCL and SDA lines after the current byte transfer
	if(state == Fun_enable)
	{
		I2Cx->CR1 |= (I2C_CR1_STOP);
	}
	else if(state == Fun_disable)
	{
		I2Cx->CR1 &= ~(I2C_CR1_STOP);
	}
}

/**================================================================
 * @Fn			-I2C_Acknowledge_Config
 * @brief 		-it is used to configure the acknowledge
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-Functional_State: it is used to determine if we need to enable or disable this function
 * @retval 		-none
 * Note			-none
================================================================**/
void I2C_Acknowledge_Config(I2C_TypeDef *I2Cx, Functional_State state)
{
	//Bit 10 ACK: Acknowledge enable
	//This bit is set and cleared by software and cleared by hardware when PE=0.
	//0: No acknowledge returned
	//1: Acknowledge returned after a byte is received (matched address or data)
	if(state == Fun_enable)
	{
		I2Cx->CR1 |= (I2C_CR1_ACK);
	}
	else if(state == Fun_disable)
	{
		I2Cx->CR1 &= ~(I2C_CR1_ACK);
	}
}

/**================================================================
 * @Fn			-Slave_States
 * @brief 		-it is used to see which ISR should call depend on State
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-State: it is the a flag that determine which ISR should we call it
 * @retval 		-none
 * Note			-none
================================================================**/
void Slave_States(I2C_TypeDef *I2Cx,Slave_State_t State)
{
	uint8_t index = (I2Cx == I2C1) ? I2C1_INDEX : I2C2_INDEX ;

	switch(State)
	{
	//*******************************************************************************
	case I2C_ERROR_AF:
		//make sure that the slave is really in transmitter mode
		if(I2Cx->SR2 & (I2C_SR2_TRA))
		{
			//Slave shouldn't send anything else
		}
		break;
	//*******************************************************************************

	//*******************************************************************************
	case I2C_EV_STOP:
		//make sure that the slave is really in transmitter mode
		if(I2Cx->SR2 & (I2C_SR2_TRA))
		{
			//Notify APP that the Stop Condition is Sent by the master
			Gl_AI2C_CFG[index].PF_Slave_Event_CallBack(I2C_EV_STOP);
		}
		break;
	//*******************************************************************************

	//*******************************************************************************
	case I2C_EV_ADDR_Matched:
		//Notify APP that The address is matched with The slave address
		Gl_AI2C_CFG[index].PF_Slave_Event_CallBack(I2C_EV_ADDR_Matched);
		break;
	//*******************************************************************************

	//*******************************************************************************
	case I2C_EV_DATA_REQ:
		//make sure that the slave is really in transmitter mode
		if(I2Cx->SR2 & (I2C_SR2_TRA))
		{
			//The APP Layer should send the data (MCAL_I2C_Slave_Tx)in this state
			Gl_AI2C_CFG[index].PF_Slave_Event_CallBack(I2C_EV_DATA_REQ);
		}
		break;
	//*******************************************************************************

	//*******************************************************************************
	case I2C_EV_DATA_RCV:
		//make sure that the slave is really in receiver mode
		if(!(I2Cx->SR2 & (I2C_SR2_TRA)) )
		{
			//The APP Layer should read the data (MCAL_I2C_Slave_Rx)in this state
			Gl_AI2C_CFG[index].PF_Slave_Event_CallBack(I2C_EV_DATA_RCV);
		}
		break;
	//*******************************************************************************
	}
}

/*
 * ======================================================================
 * 								APIs
 * ======================================================================
 */

/**================================================================
 * @Fn			-MCAL_I2C_Init
 * @brief 		-initialize I2C
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-I2C_Config: it is a structure containing configuration of I2C.
 * @retval 		-none
 * Note			-none
================================================================**/
void MCAL_I2C_Init(I2C_TypeDef *I2Cx, I2C_Configuration_t *I2C_Config)
{
	uint16_t TempReg = 0;
	uint32_t PClk1 = 8000000;
	uint16_t FreqRange = 0, CCR_Val = 0, RiseTime = 0;

	/*-------------------------------enable clock for peripheral--------------------------*/
	if(I2Cx == I2C1)
	{
		RCC_I2C1_CLK_EN();
		Gl_AI2C_CFG[I2C1_INDEX] = *I2C_Config;
	}
	else if(I2Cx == I2C2)
	{
		RCC_I2C2_CLK_EN();
		Gl_AI2C_CFG[I2C2_INDEX] = *I2C_Config;
	}

	/*-------------------------------see if we are in I2C Mode or SMBus Mode--------------------------*/
	if(I2C_Config->I2C_Mode == I2C_Mode_I2C)
	{
		/* Disable the peripheral till we initialize the clock and the timing of the peripheral */
		I2Cx->CR1 &= ~(I2C_CR1_PE_Msk);

