MostafaEdrees11/Mastering_Embedded_System_Online_Diploma/Unit8_MCU_Interfacing/Lesson7_I2C_Driver/I2C_Driver_STM32F103C6/STM32_F103C6_Drivers/I2C/STM32F103x8_I2C_Driver.c
		/*-------------------------------Initialize the Peripheral Clock & Time--------------------------*/

		//*******************************************************************************
		//Program the peripheral input clock in I2C_CR2 Register in order to generate correct timings
		//		--> Bits 5:0 FREQ[5:0]: Peripheral clock frequency in I2C_CR2

		/* Get PClk1 by using RCC Driver */
		PClk1 = MCAL_RCC_GetPCLK1Freq();

		/* Frequency Range --> FREQ = PClk1 / 1000000(M) */
		FreqRange = (uint16_t)(PClk1 / 1000000);

		/* Write FREQ on I2C_CR2 */
		I2Cx->CR2 &= ~(I2C_CR2_FREQ_Msk);
		I2Cx->CR2 |= (FreqRange << I2C_CR2_FREQ_Pos);
		//*******************************************************************************

		//*******************************************************************************
		//Configure the clock control registers
		//		--> Bits 11:0 CCR[11:0]: Clock control register in Fm/Sm mode (Master mode) in (I2C_CCR)

		/* Set Master Mode Selection --> Standard or Fast Mode */
		TempReg = I2C_Config->I2C_Master_Mode_Selection;

		if(I2C_Config->I2C_Master_Mode_Selection == I2C_Master_Mode_Selection_SM)
		{
			/* Calculate CCR value from the equation <Standard Mode> */
			//Thigh = CCR * TPClk1
			//Ti2cclock = Thigh + Tlow ------> Thigh = Ti2cclock / 2
			//CCR = Ti2cclock / (2 * TPClk1)
			//CCR = FPClk1 / (2 * Fi2cclock)
			CCR_Val = (uint16_t)(PClk1 / (I2C_Config->I2C_ClockSpeed << 1));

			TempReg |= CCR_Val;
		}
		else if(I2C_Config->I2C_Master_Mode_Selection == I2C_Master_Mode_Selection_FM)
		{
			//Fast Mode is not supported
		}

		/* Write CCR Value on I2C_CCR */
		I2Cx->CCR = TempReg;
		//*******************************************************************************

		//*******************************************************************************
		//Configure the rise time register
		//		--> Bits 5:0 TRISE[5:0]: Maximum rise time in Fm/Sm mode (Master mode) in (I2C_TRISE)
		//		--> the maximum allowed SCL rise time is 1000 ns.
		//		--> If, in the I2C_CR2 register, the value of FREQ[5:0] bits is equal to 0x08 and TPCLK1 = 125 ns
		//			therefore the TRISE[5:0] bits must be programmed with 09h.
		//			(1000 ns / 125 ns = 8 + 1)
		RiseTime = FreqRange + 1;
		I2Cx->TRISE |= RiseTime;
		//*******************************************************************************


		/*-------------------------------Initialize the I2C_CR1 Register Configuration --------------------------*/
		I2Cx->CR1 |= (I2C_Config->I2C_Mode | I2C_Config->I2C_General_Call_Control | I2C_Config->I2C_Clock_Stretching | I2C_Config->I2C_ACK_Control);

		/*-------------------------------Initialize the I2C_CR2 Register Configuration --------------------------*/
		//we do the configuration of the clock & we will do configuration of Interrupts if we are a slave
		/* we use Interrupt Mechanism when we are in Slave Mode */
		if(I2C_Config->PF_Slave_Event_CallBack != NULL)
		{
			/* Enable all Interrupts Slave */
			//Bit 8 ITERREN: Error interrupt enable
			I2Cx->CR2 |= (I2C_CR2_ITERREN);
			//Bit 9 ITEVTEN: Event interrupt enable
			I2Cx->CR2 |= (I2C_CR2_ITEVTEN);
			//Bit 10 ITBUFEN: Buffer interrupt enable
			I2Cx->CR2 |= (I2C_CR2_ITBUFEN);

			/* Enable Interrupts from NVIC */
			if(I2Cx == I2C1)
			{
				NVIC_I2C1_EV_IRQ31_ENABLE;
				NVIC_I2C1_ER_IRQ32_ENABLE;
			}
			else if(I2Cx == I2C2)
			{
				NVIC_I2C2_EV_IRQ33_ENABLE;
				NVIC_I2C2_ER_IRQ34_ENABLE;
			}
		}

		/*-------------------------------Initialize the I2C_OAR1 Register Configuration --------------------------*/
		/*-------------------------------Initialize the I2C_OAR2 Register Configuration --------------------------*/
		//Set Primary address of the slave & choose the slave address mode
		TempReg = 0;
		TempReg |= I2C_Config->I2C_Slave_Device_Address.I2C_Slave_Address_Length;
		TempReg |= (I2C_Config->I2C_Slave_Device_Address.I2C_Primary_Slave_Address << I2C_OAR1_ADD_Pos);
		I2Cx->OAR1 = TempReg;

		//check if Dual address is enable
		if(I2C_Config->I2C_Slave_Device_Address.I2C_Slave_Address_DUAL == I2C_Slave_Address_DUAL_Enable)
		{
			//Set Secondary address of the slave & enable the dual slave address mode
			TempReg = I2C_Slave_Address_DUAL_Enable;
			TempReg |= (I2C_Config->I2C_Slave_Device_Address.I2C_Secondary_Slave_Address << I2C_OAR2_ADD2_Pos);
			I2Cx->OAR2 = TempReg;
		}


		/*-------------------------------Initialize the I2C_SR1 Register Configuration --------------------------*/
		/*-------------------------------Initialize the I2C_SR2 Register Configuration --------------------------*/
		I2Cx->SR1 = 0;
		I2Cx->SR2 = 0;


		/*-------------------------------Enable the Peripheral --------------------------*/
		I2Cx->CR1 |= (I2C_CR1_PE_Msk);

	}
	else if(I2C_Config->I2C_Mode == I2C_Mode_SMBus)
	{
		//SMBus is not supported
	}
}

/**================================================================
 * @Fn			-MCAL_I2C_DeInit
 * @brief 		-Deinitialize I2C
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @retval 		-none
 * Note			-none
================================================================**/
void MCAL_I2C_DeInit(I2C_TypeDef *I2Cx)
{
	if(I2Cx == I2C1)
	{
		/* Disable Interrupts & then Reset Clock */
		NVIC_I2C1_EV_IRQ31_DISABLE;
		NVIC_I2C1_ER_IRQ32_DISABLE;

		RCC_I2C1_Reset();
	}
	else if(I2Cx == I2C2)
	{
		/* Disable Interrupts & then Reset Clock */
		NVIC_I2C2_EV_IRQ33_DISABLE;
		NVIC_I2C2_ER_IRQ34_DISABLE;

		RCC_I2C2_Reset();
	}
}


/**================================================================
 * @Fn			-MCAL_GPIO_I2C_Set_Pins
 * @brief 		-initialize GPIO pins
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @retval 		-none
 * Note			-we should enable the corresponding AFIO & GPIO in RCC clock also called after MCAL_I2C_Init()
================================================================**/
void MCAL_GPIO_I2C_Set_Pins(I2C_TypeDef *I2Cx)
{
	GPIO_PIN_Configuration_t PinCFG;

	/*
	 * I2Cx_SCL --> Alternate function open drain
	 * I2Cx_SDA --> Alternate function open drain
	 */

	if(I2Cx == I2C1)
	{
		/*
		 * SCL --> PB6
		 * SDA --> PB7
		 */
		//*******************************************************************************
		//Configure SCL of I2C1
		PinCFG.GPIO_PinNumber = GPIO_PIN_6;
		PinCFG.GPIO_PinMODE = GPIO_MODE_OUTPUT_AF_OD;
		PinCFG.GPIO_PinSPEED = GPIO_SPEED_10MHz;
		MCAL_GPIO_Init(GPIOB, &PinCFG);
		//*******************************************************************************

		//*******************************************************************************
		//Configure SDA of I2C1
		PinCFG.GPIO_PinNumber = GPIO_PIN_7;
		PinCFG.GPIO_PinMODE = GPIO_MODE_OUTPUT_AF_OD;
		PinCFG.GPIO_PinSPEED = GPIO_SPEED_10MHz;
		MCAL_GPIO_Init(GPIOB, &PinCFG);
		//*******************************************************************************
	}
	else if(I2Cx == I2C2)
	{
		/*
		 * SCL --> PB10
		 * SDA --> PB11
		 */
		//*******************************************************************************
		//Configure SCL of I2C2
		PinCFG.GPIO_PinNumber = GPIO_PIN_10;
		PinCFG.GPIO_PinMODE = GPIO_MODE_OUTPUT_AF_OD;
		PinCFG.GPIO_PinSPEED = GPIO_SPEED_10MHz;
		MCAL_GPIO_Init(GPIOB, &PinCFG);
		//*******************************************************************************

		//*******************************************************************************
		//Configure SDA of I2C2
		PinCFG.GPIO_PinNumber = GPIO_PIN_11;
		PinCFG.GPIO_PinMODE = GPIO_MODE_OUTPUT_AF_OD;
		PinCFG.GPIO_PinSPEED = GPIO_SPEED_10MHz;
		MCAL_GPIO_Init(GPIOB, &PinCFG);
		//*******************************************************************************
	}
}

