MostafaEdrees11/Mastering_Embedded_System_Online_Diploma/Unit8_MCU_Interfacing/Lesson7_I2C_Driver/I2C_Driver_STM32F103C6/STM32_F103C6_Drivers/I2C/STM32F103x8_I2C_Driver.c
		I2C_Acknowledge_Config(I2Cx, Fun_disable);
	}

	//*******************************************************************************
	//7.Stop Condition
	if(stop == With_Stop)
	{
		I2C_Generate_Stop_Condition(I2Cx, Fun_enable);
	}
	//*******************************************************************************

	//*******************************************************************************
	//Re-Enabel Acknowledge
	if(Gl_AI2C_CFG[Index].I2C_ACK_Control == I2C_ACK_Control_Enable)
	{
		I2C_Acknowledge_Config(I2Cx, Fun_enable);
	}
	//*******************************************************************************
}

/**================================================================
 * @Fn			-MCAL_I2C_Slave_Tx
 * @brief 		-Slave transmit data
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-Data: it is the data that we need to sent it
 * @retval 		-it return the data that exist in Data Register
 * Note			-none
================================================================**/
void MCAL_I2C_Slave_Tx(I2C_TypeDef *I2Cx, uint8_t Data)
{
	I2Cx->DR = Data;
}

/**================================================================
 * @Fn			-MCAL_I2C_Slave_Rx
 * @brief 		-Slave receive data
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @retval 		-it return the data that exist in Data Register
 * Note			-none
================================================================**/
uint8_t MCAL_I2C_Slave_Rx(I2C_TypeDef *I2Cx)
{
	return (uint8_t)(I2Cx->DR);
}

void I2C1_EV_IRQHandler(void)
{
	volatile uint32_t dummy_Read = 0;
	I2C_TypeDef *I2Cx = I2C1;

	//interrupt handling for Master & Slave mode of a device
	uint32_t temp1, temp2, temp3;

	//*******************************************************************************
	temp1 = ( (I2Cx->CR2) & (I2C_CR2_ITEVTEN) );
	temp2 = ( (I2Cx->CR2) & (I2C_CR2_ITBUFEN) );
	//*******************************************************************************

	//*******************************************************************************
	temp3 = ( (I2Cx->SR1) & (I2C_SR1_STOPF) );

	//Handle For Interrupt generated by STOPF event
	//Note : Stop detection flag is applicable only slave mode
	if(temp1 && temp3)
	{
		// STOP Flag is Set
		// Clear the STOPF by reading SR1 register followed by writing to CR1 register
		dummy_Read = I2Cx->SR1;
		I2Cx->CR1 = 0x0000;
		Slave_States(I2Cx,I2C_EV_STOP);
	}
	//*******************************************************************************

	//*******************************************************************************
	temp3 = I2Cx->SR1 & (I2C_SR1_ADDR);

	//Handle For Interrupt generated by ADDR event
	//Note :When master mode : Address is sent
	//		When slave mode  : Address is matched with own address
	if(temp1 && temp3)
	{
		// Interrupt is generated because of ADDR event
		// check for device mode
		if(I2Cx->SR2 & (I2C_SR2_MSL))
		{
			//Master mode
		}
		else
		{
			//Slave mode
			//Clear the ADDR flag (Read SR1 , Read SR2)
			dummy_Read = I2Cx->SR1;
			dummy_Read = I2Cx->SR2;
			Slave_States(I2Cx,I2C_EV_ADDR_Matched);
		}
	}
	//*******************************************************************************

	//*******************************************************************************
	temp3 = I2Cx->SR1 & (I2C_SR1_TXE);

	//Handle For Interrupt generated by TXE event
	if(temp1 && temp3)
	{
		// Interrupt is generated because of TXE event
		// check for device mode
		if(I2Cx->SR2 & (I2C_SR2_MSL))
		{
			//Master mode
		}
		else
		{
			//Slave mode
			Slave_States(I2Cx,I2C_EV_DATA_REQ);
		}
	}
	//*******************************************************************************

	//*******************************************************************************
	temp3 = I2Cx->SR1 & (I2C_SR1_RXNE);

	//Handle For Interrupt generated by RXNE event
	if(temp1 && temp3)
	{
		// Interrupt is generated because of RXNE event
		// check for device mode
		if(I2Cx->SR2 & (I2C_SR2_MSL))
		{
			//Master mode
		}
		else
		{
			//Slave mode
			Slave_States(I2Cx,I2C_EV_DATA_RCV);
		}
	}
	//*******************************************************************************
}

void I2C1_ER_IRQHandler(void)
{

}

void I2C2_EV_IRQHandler(void)
{

}

void I2C2_ER_IRQHandler(void)
{

}
